{
  "news": [
    {
      "headline": "Bharti Airtel founder Mittal in talks to buy 49% stake in Haier India",
      "text": "Bharti Airtel's founder, Sunil Mittal, is reportedly in advanced negotiations to acquire a 49% stake in Haier India, the Indian arm of the Chinese electronics manufacturer Haier. This deal, estimated at around $2 billion, could see Mittal partnering with private equity firm Warburg Pincus. While discussions are at an advanced stage, the deal may still not go through as Haier may decide to back out, and other interested parties might emerge as potential buyers. The final decision is expected soon."
    },
    {
      "headline": "India grants conditional approval for Starlink's operations in the country",
      "text": "In a major development, the Indian government has granted conditional approval for SpaceX's Starlink satellite internet service to commence operations in India. Bharti Airtel has secured a distribution agreement with Starlink, which will allow it to offer satellite internet services across the country. This approval follows a long-standing debate about spectrum allocation between Elon Musk and Mukesh Ambani's Reliance Industries. The government's decision to approve Starlink's method of spectrum allocation paves the way for its launch in India."
    },
    {
      "headline": "Bharti Airtel Q3 FY25 Earnings: Profit up by 461%",
      "text": "Bharti Airtel reported an impressive consolidated net profit of ₹16,134.6 crore for the third quarter of FY25, showing a massive 461% increase compared to ₹2,876.4 crore in the same quarter the previous year. The company’s revenue from operations saw a 19.08% year-on-year growth, fueled by strong performance in both India and Africa. Additionally, Airtel’s EBITDA surged by 24.1%, and its margin improved to 55.1%, reflecting robust growth across various segments."
    },
    {
      "headline": "Bharti Airtel stock declines despite strong Q3 earnings",
      "text": "Despite reporting strong earnings for Q3 FY25, Bharti Airtel's stock took a hit, declining by 1.23% on May 8, 2025. The stock closed at ₹1,872.70, underperforming the broader market that day. However, it is noteworthy that the stock remains only 2.31% below its 52-week high of ₹1,916.90, which was reached on May 7, indicating that the stock still holds strong potential in the market despite the recent dip."
    }
  ]
}
