{
    "news": [
      {
        "headline": "Infosys wraps up acquisition of Australian cybersecurity firm The Missing Link",
        "text": "Indian IT giant Infosys has completed the acquisition of The Missing Link, an Australian cybersecurity services specialist. The Missing Link brings a team of cybersecurity professionals, including Red Team, Blue Team, and a Global Security Operations Centre, to Infosys. The deal is expected to complement Infosys' global cyber defence centres and strengthen its cybersecurity capabilities, especially in the Australian market. Infosys aims to deliver differentiated value to customers through its offerings like Infosys Cobalt, a suite of services designed to fast-track cloud transformation."
      },
      {
        "headline": "Announcing Infosys Topaz for SAP S/4HANA Cloud: An AI-first Offering that helps Enterprises Harness AI and Gen AI Technologies to Accelerate SAP S/4HANA Cloud Transformation",
        "text": "Infosys has launched Infosys Topaz for SAP S/4HANA Cloud, an AI-first suite aimed at helping enterprises harness AI and Gen AI technologies to accelerate their SAP S/4HANA Cloud transformation. The suite brings together industry-specific playbooks, AI-infused accelerators, and proven solutions to enable businesses to reimagine their value chain. It also provides a pathway for an AI-ready composable architecture that accelerates SAP S/4HANA Cloud adoption and helps unlock data value with a future-ready architecture."
      },
      {
        "headline": "Infosys Ltd (INFY) Q4 2025 Earnings Call Highlights: Strong Cash Flow Amid Revenue Challenges",
        "text": "Infosys reported 4.2% revenue growth in constant currency terms for FY25, with a strong operating margin of 21.1%. The company generated $4.1 billion in free cash flow, 129% of net profit. Infosys closed $11.6 billion in large deals, with 63% of them being net new. However, revenue declined by 3.5% sequentially in Q4 due to seasonal weakness, and FY26 guidance indicates slower growth, ranging from 0% to 3%. The company expects a reduction in third-party revenues and faces challenges in the communications and manufacturing sectors."
      }
    ]
  }
  