{
    "news": [
      {
        "headline": "L&T's Stock Performance on May 6, 2025",
        "text": "On May 6, 2025, Larsen & Toubro Ltd. (L&T) shares rose by 0.18% to close at ₹3,334.45, outperforming several industry peers despite a generally weak stock market session. The BSE SENSEX Index declined by 0.19% to 80,641.07. L&T's stock remains 15.86% below its 52-week high of ₹3,963.00 recorded on December 10. Trading volume was 134,207 shares, exceeding its 50-day average of 101,470, indicating increased investor activity."
      },
      {
        "headline": "L&T Secures Major Power Transmission Orders in India and Overseas",
        "text": "In March 2025, L&T's Power Transmission & Distribution vertical secured significant contracts in India, Saudi Arabia, and Abu Dhabi, totaling up to ₹5,000 crore. These projects include building a crucial 380 kV substation in Saudi Arabia to help evacuate solar power, contributing to the country's renewable energy goals."
      },
      {
        "headline": "L&T to Build AI-enabled Data Centre in Tashkent",
        "text": "In January 2025, L&T received a significant order valued between ₹1,000 crore to ₹2,500 crore to build Uzbekistan's first AI-enabled and sustainable 10-Megawatt data centre in Tashkent. The project aims to set new standards for data centre infrastructure in the region, combining cutting-edge technology with a strong commitment to sustainability."
      },
      {
        "headline": "L&T Bags Solar PV and Battery Storage Gigascale Project in Abu Dhabi",
        "text": "L&T's renewables business vertical was selected by Masdar as one of the preferred Engineering, Procurement, and Construction (EPC) contractors for the north site of the world's first 24/7 solar PV and battery storage gigascale project in Abu Dhabi. The project will feature a 5.2GW (DC) solar photovoltaic (PV) plant coupled with a 19 gigawatt-hour battery storage system."
      },
      {
        "headline": "L&T Wins Major Desalination Contract in Saudi Arabia",
        "text": "In March 2025, L&T, in partnership with Lantania, won a contract to build a desalination plant in Saudi Arabia with a capacity of 300,000 cubic meters per day. This project strengthens L&T's presence in the Middle East and aligns with its focus on water treatment solutions."
      }
    ]
  }
  