{
    "news": [
      {
        "headline": "Reliance Industries Reports Record Revenue and Profit in Q4 FY25",
        "text": "Reliance Industries posted a consolidated revenue of ₹2.88 lakh crore ($33.7 billion) for Q4 FY25, marking an 8.8% year-over-year increase. The company's net profit rose to ₹22,611 crore, driven by strong performances in its telecom (Jio) and retail segments. The board declared a dividend of ₹5.5 per share for FY25."
      },
      {
        "headline": "Reliance Shares Surge Over 5% Following Strong Q4 Earnings",
        "text": "Shares of Reliance Industries surged over 5% on April 28, 2025, following the announcement of better-than-expected Q4 earnings. The stock reached its highest point since late October 2024, with analysts citing robust growth in the company's telecom and retail businesses as key drivers."
      },
      {
        "headline": "Jefferies Increases Stake in Reliance Industries",
        "text": "Jefferies' Chris Wood raised the stake in Reliance Industries within the firm's India portfolio, reflecting increased confidence in the company's growth prospects. The move aligns with a broader strategy of enhancing exposure to key Indian equities."
      },
      {
        "headline": "Samsung Challenges $520 Million Tax Demand, Cites Reliance's Past Practices",
        "text": "Samsung is contesting a $520 million tax demand from Indian authorities, arguing that its import classification practices were consistent with those previously employed by Reliance Jio. Samsung claims that Indian officials were aware of these practices and did not raise concerns during the relevant period."
      },
      {
        "headline": "Reliance and Disney Finalize $8.5 Billion Media Merger",
        "text": "Reliance Industries and The Walt Disney Company have finalized an $8.5 billion merger of their Indian media assets, including Viacom18 and Disney Star. The joint venture aims to create a comprehensive entertainment platform, combining streaming services like JioCinema and Disney+ Hotstar with various television channels."
      }
    ]
  }
  