{
    "news": [
      {
        "headline": "SBI Q4 FY25 Net Profit Declines 10% YoY; Declares ₹15.90 Dividend",
        "text": "State Bank of India reported a net profit of ₹18,642.5 crore for Q4 FY25, marking a 10% decline year-on-year. Despite this, the bank declared a dividend of ₹15.90 per share, the highest in 12 years. Net interest income rose by 2.7% to ₹42,774.55 crore, while operating profit increased by 8.83% to ₹31,286 crore. However, loan loss provisions surged by 20.35% to ₹3,964 crore."
      },
      {
        "headline": "SBI Plans to Raise ₹25,000 Crore in Equity Capital for FY26",
        "text": "To strengthen its capital base, SBI's board has approved raising up to ₹25,000 crore in equity capital during FY26. The funds may be raised through various modes, including Qualified Institutional Placement (QIP) and Follow-on Public Offer (FPO), depending on market conditions."
      },
      {
        "headline": "Citi Upgrades SBI Stock Rating and Raises Price Target to ₹920",
        "text": "Citi analysts have upgraded SBI's stock rating from 'Sell' to 'Buy' and increased the price target to ₹920. The upgrade is attributed to the bank's focus on optimizing liability costs, rebound in Xpress Credit growth, and efforts to manage credit costs effectively."
      },
      {
        "headline": "SBI Projects 12-13% Loan Growth Amid Tariff Uncertainty",
        "text": "SBI aims for a 12-13% loan growth in FY26, maintaining levels similar to the previous year, due to uncertainties related to global tariffs. The bank reported a loan growth of 12.03% and deposit growth of 9.48% for FY25. The corporate loan pipeline stood at ₹3.4 trillion at the end of March."
      },
      {
        "headline": "SBI Expects Inflation to Remain Below 3% in Q1 FY26",
        "text": "A report by SBI forecasts India's retail inflation to stay below 3% until June 2025, driven by a significant drop in food prices. The bank anticipates an average Consumer Price Index (CPI) of 3.7-3.8% for FY26 and suggests that the Reserve Bank of India consider cutting interest rates as the economy enters a 'Goldilocks period'."
      }
    ]
  }
  